public/pubs/index.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2023-03-11 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Pubs</title>
<meta name="generator" content="Org Mode" />
<link rel="icon" type="image/x-icon" href="/favicon.ico"> <link rel="stylesheet" href="/style.css" />
</head>
<body>
<div id="preamble" class="status">
<div id="navbar">
    <a href="/"><div class="navitem home">&heartsuit;</div></a>
    <a href="/pubs"><div class="navitem">pubs</div></a>
    <a href="/blog"><div class="navitem">blog</div></a>
    <a href="/meta"><div class="navitem">meta</div></a>
    <a href="/files/Sricharan_AR_CV.pdf"><div class="navitem">cv</div></a>
</div> <hr>
</div>
<div id="content" class="content">

<div id="outline-container-orgea70f7a" class="outline-2">
<h2 id="orgea70f7a">2023</h2>
<div class="outline-text-2" id="text-orgea70f7a">
</div>
<div id="outline-container-orge7f5b4d" class="outline-4">
<h4 id="orge7f5b4d">Electrical Flows for Polylogarithmic Competitive Oblivious Routing</h4>
<div class="outline-text-4" id="text-orge7f5b4d">
<p>
with Gramoz Goranci, Monika Henzinger, Harald Räcke, and Sushant Sachdeva
</p>

<p>
<a href="https://arxiv.org/abs/2303.02491">arXiv</a> /
<a href="https://arxiv.org/pdf/2303.02491.pdf">pdf</a>
</p>
</div>
</div>

<div id="outline-container-orgb625938" class="outline-4">
<h4 id="orgb625938">Differentially Private Data Structures under Continual Observation for Histograms and Related Queries</h4>
<div class="outline-text-4" id="text-orgb625938">
<p>
with Monika Henzinger and Teresa Anna Steiner
</p>

<p>
<a href="https://arxiv.org/abs/2302.11341">arXiv</a> /
<a href="https://arxiv.org/pdf/2302.11341.pdf">pdf</a>
</p>
</div>
</div>
</div>

<div id="outline-container-org94ef7aa" class="outline-2">
<h2 id="org94ef7aa">2022</h2>
<div class="outline-text-2" id="text-org94ef7aa">
</div>
<div id="outline-container-org33ad9a3" class="outline-4">
<h4 id="org33ad9a3">Fine-Grained Complexity Lower Bounds for Families of Dynamic Graphs</h4>
<div class="outline-text-4" id="text-org33ad9a3">
<p>
with Monika Henzinger and Ami Paz
</p>

<p>
<a href="https://drops.dagstuhl.de/opus/volltexte/2022/17003">ESA 2022</a> /
<a href="https://arxiv.org/abs/2208.07572">arXiv</a> /
<a href="https://arxiv.org/pdf/2208.07572.pdf">pdf</a>
</p>
</div>
</div>
</div>

<div id="outline-container-orge1c6c31" class="outline-2">
<h2 id="orge1c6c31">2021</h2>
<div class="outline-text-2" id="text-orge1c6c31">
</div>
<div id="outline-container-orga8d1641" class="outline-4">
<h4 id="orga8d1641">On Approximate Envy-Freeness for Indivisible Chores and Mixed Resources</h4>
<div class="outline-text-4" id="text-orga8d1641">
<p>
with Umang Bhaskar and Rohit Vaish
</p>

<p>
<a href="https://drops.dagstuhl.de/opus/volltexte/2021/14694/">APPROX 2021</a> /
<a href="https://arxiv.org/abs/2012.06788">arXiv</a> /
<a href="https://arxiv.org/pdf/2012.06788.pdf">pdf</a> /
<a href="https://www.youtube.com/watch?v=keJ6xrci40k">Video</a>
</p>
</div>
</div>

<div id="outline-container-org5350814" class="outline-4">
<h4 id="org5350814">Completely Mixed Bimatrix Games</h4>
<div class="outline-text-4" id="text-org5350814">
<p>
with T Parthasarathy and Vasudha Sharma
</p>

<p>
<a href="https://link.springer.com/article/10.1007/s12044-020-00585-5">Proceedings-Mathematical Sciences</a>
</p>
</div>
</div>
</div>
</div>
</body>
</html>